app/Controllers/AuthController.php

    public function login()
    {
        $tel = $this->request->getPost('tel');
        if (empty($tel)) {
            return redirect()->back()->with('error', 'Le numéro de téléphone est requis.');
        }

        // Vérification du préfixe
        $prefixeModel = new PrefixeModel();
        $prefixes = $prefixeModel->findAll();
        $valide = false;

        foreach ($prefixes as $p) {
            if (strpos($tel, $p['prefixe']) === 0) {
                $valide = true;
                break;
            }
        }

        if (!$valide) {
            return redirect()->back()->with('error', 'Numéro invalide pour cet opérateur.');
        }

        // Connexion ou création automatique du compte
        $compteModel = new CompteModel();
        $compte = $compteModel->where('telephone', $tel)->first();

        if (!$compte) {
            $id = $compteModel->insert([
                'telephone' => $tel,
                'solde'     => 0.0
            ]);
            $compte = $compteModel->find($id);
---
SELECT *
FROM `compte`
WHERE `telephone` = '0331462054'
 LIMIT 1
INSERT INTO `compte` (`telephone`, `solde`, `created_at`) VALUES ('0331462054', 0, '2026-07-20 09:47:36')
SELECT *
FROM `compte`
WHERE `compte`.`id` = 2