app/Controllers/ClientController.php

    public function dashboard()
    {
        $session = session()->get('client_session');

        // CORRECTION DE SÉCURITÉ : Si pas de session, on renvoie vers le login, pas vers l'index !
        if (!$session) {
            return redirect()->to('/auth/login')->with('error', 'Veuillez vous connecter pour accéder à votre espace.');
        }

        $compteModel = new CompteModel();
        $compte = $compteModel->find($session['id']);

        $txModel = new TransactionsModel();
        $historique = $txModel->select('transactions.*, type_operations.nom as type')
                              ->join('type_operations', 'type_operations.id = transactions.id_type_operation')
                              ->groupStart()
                                  ->where('id_compte_expediteur', $compte['id'])
                                  ->orWhere('id_compte_destinataire', $compte['id'])
                              ->groupEnd()
                              ->orderBy('date_transaction', 'DESC')
                              ->findAll();
---
SELECT *
FROM `compte`
WHERE `compte`.`id` = 1
SELECT `transactions`.*, `type_operations`.`nom` as `type`
FROM `transactions`
JOIN `type_operations` ON `type_operations`.`id` = `transactions`.`id_type_operation`
WHERE   (
`id_compte_expediteur` = 1
OR `id_compte_destinataire` = 1
 )
ORDER BY `date_transaction` DESC