app/Controllers/OperateurController.php

SELECT SUM(`frais`) AS `frais`
FROM `transactions`
WHERE `id_type_operation` = 2
 LIMIT 1
SELECT SUM(`frais`) AS `frais`
FROM `transactions`
WHERE `id_type_operation` = 3
 LIMIT 1
SELECT *
FROM `compte`
SELECT `prefixes`.*, `operateurs`.`nom` as `operateur`, `operateurs`.`type_reseau`
FROM `prefixes`
JOIN `operateurs` ON `operateurs`.`id` = `prefixes`.`id_operateur`
SELECT *
FROM `operateurs`
SELECT `interoperator_commissions`.*, `operateurs`.`nom`
FROM `interoperator_commissions`
JOIN `operateurs` ON `operateurs`.`id` = `interoperator_commissions`.`id_operateur`
SELECT `baremes`.*, `type_operations`.`nom` as `type`
FROM `baremes`
JOIN `type_operations` ON `type_operations`.`id` = `baremes`.`id_type_operation`
---
    public function dashboard()
    {
        $compteModel = new CompteModel();
        $prefixeModel = new PrefixeModel();
        $baremeModel = new BaremesModel();
        $txModel = new TransactionsModel();

        // 1. Calcul des gains via les frais de transactions (Type 2 = Retrait, Type 3 = Transfert)
        $gains_retrait = $txModel->where('id_type_operation', 2)->selectSum('frais')->first()['frais'] ?? 0;
        $gains_transfert = $txModel->where('id_type_operation', 3)->selectSum('frais')->first()['frais'] ?? 0;
        $gains_totaux = $gains_retrait + $gains_transfert;

        // 2. Récupération des données pour les tableaux
        $clients = $compteModel->findAll();
        $prefixes = $prefixeModel->select('prefixes.*, operateurs.nom as operateur, operateurs.type_reseau')
                                ->join('operateurs', 'operateurs.id = prefixes.id_operateur')
                                ->findAll();
        $operateurs = (new \App\Models\OperateurModel())->findAll();
        $commissions = (new \App\Models\InteroperatorCommissionModel())
                        ->select('interoperator_commissions.*, operateurs.nom')
                        ->join('operateurs', 'operateurs.id = interoperator_commissions.id_operateur')
                        ->findAll();

        // Jointure pour afficher le nom du type d'opération lisiblement
        $baremes = $baremeModel->select('baremes.*, type_operations.nom as type')
                              ->join('type_operations', 'type_operations.id = baremes.id_type_operation')
                              ->findAll();