app/Controllers/TransactionsController.php

    private function calculerFrais(int $typeOpId, float $montant): float
    {
        $bareme = $this->baremeModel
                       ->where('id_type_operation', $typeOpId)
                       ->where('montant_min <=', $montant)
                       ->where('montant_max >=', $montant)
                       ->first();
---
SELECT *
FROM `baremes`
WHERE `id_type_operation` = 2
AND `montant_min` <= 1.01
AND `montant_max` >= 1.01
 LIMIT 1

    public function depot($compteId = null, $montant = null)
    {
        if (!$compteId || !$montant) {
            $compteId = $this->request->getPost('compte_id');
            $montant  = (float) $this->request->getPost('montant');
        }

        if ($montant <= 0) {
            return redirect()->back()->with('error', 'Montant invalide');
        }

        try {
            $compte = $this->compteModel->find($compteId);
            if (!$compte) {
                return redirect()->back()->with('error', 'Compte inexistant');
            }

            $db = \Config\Database::connect();
            $db->transStart();

            // 1. Calcul et mise à jour du nouveau solde
            $nouveauSolde = $compte['solde'] + $montant;
            $this->compteModel->update($compteId, ['solde' => $nouveauSolde]);

            // 2. Enregistrement de la transaction (1 = Dépôt)
            $this->transactionModel->insert([
                'id_type_operation'     => 1,
                'id_compte_expediteur'  => $compteId,
                'id_compte_destinataire'=> null,
                'montant'               => $montant,
                'frais'                 => 0.0
            ]);
---
SELECT *
FROM `compte`
WHERE `compte`.`id` = '3'
UPDATE `compte` SET `solde` = 1000.01
WHERE `compte`.`id` IN ('3')
INSERT INTO `transactions` (`id_type_operation`, `id_compte_expediteur`, `id_compte_destinataire`, `montant`, `frais`) VALUES (1, '3', NULL, 1000, 0)

    public function retrait($compteId = null, $montant = null)
    {
        if (!$compteId || !$montant) {
            $compteId = $this->request->getPost('compte_id');
            $montant  = (float) $this->request->getPost('montant');
        }

        if ($montant <= 0) {
            return redirect()->back()->with('error', 'Montant invalide');
        }

        try {
            $compte = $this->compteModel->find($compteId);
---
SELECT *
FROM `compte`
WHERE `compte`.`id` = '3'

            $this->compteModel->update($compteId, ['solde' => $nouveauSolde]);

            // 2. Enregistrement transaction
            $this->transactionModel->insert([
                'id_type_operation'     => 2,
                'id_compte_expediteur'  => $compteId,
                'id_compte_destinataire'=> null,
                'montant'               => $montant,
                'frais'                 => $frais
            ]);
---
INSERT INTO `transactions` (`id_type_operation`, `id_compte_expediteur`, `id_compte_destinataire`, `montant`, `frais`) VALUES (2, '3', NULL, 1.01, 0)