app/Controllers/TransactionsController.php

UPDATE `compte` SET `solde` = 0.01
WHERE `compte`.`id` IN ('3')
---
        $db->transStart();

        // Déduction globale chez l'expéditeur
        $compteModel->update($expediteur['id'], [
            'solde' => $expediteur['solde'] - $coutTotalRetire
        ]);